/*
ⸯ     				     ༿───────────═🙦 🎕 🙤═───────────᠎༾
█⌇𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙⌇█      🙢 TRANSFORM TOOL  🙠     █⌇𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙𝄙⌇█
▓﹊﹊﹊﹊﹊﹊﹊﹊﹊﹊﹊﹊╰────────────⏜⏝⏜⏝⏜⏝⏜────────────╯﹊﹊﹊﹊﹊﹊﹊﹊﹊﹊﹊﹊▓
▓  ...
▓
▓ ❖ ...
▓   ◇ Process
▓     ⬥ Rotate (N-Angle)
▓     ⬥ Scale (N-Percent)
▓     ⬥ Translate (N-Number)
▓     ⬥ Skew ()
▓     ⬥ Perspective ()
▓     ⬥ Matrix ()
▓   ◇ Action
▓     ⬥ ...
▓     ⬥ Flip horizontally
▓     ⬥ Flip vertically
▓     ⬥ Rotate 180
▓     ⬥ Reset transform
▓   ◇ Components
▓     ⬥ [Transform button/bar/panel]
▓▓
▓ ❖ TODO
▓   ◇ ...
▓     ⬥ ...
▓       - ...
▓
▓═──────────────══─────────────══🙦⟅ ∽ 🎕 ∼ ⟆🙤══─────────────══──────────────═█ */
